#ifndef	__MKEY_H
#define	__MKEY_H

#include	"config.h"
#include "GPIO.h"
#include "MKEY.h"
/************************************************************
宏定义区：
************************************************************/
#define R1 P60
#define R2 P61
#define R3 P62
#define R4 P63
#define C1 P64
#define C2 P65
#define C3 P66
#define C4 P67

/************************************************************
变量声明区：
************************************************************/


/************************************************************
函数声明区：
************************************************************/
void	KEY_GPIO_config(void);
static u8 KeyState(void);
u8 Key_Read(void);

u8 Mkey_Read(void);
#endif
